/*
 * PhoneBook 클래스...

// HashMap을 이용해 전화번호부를 구현해보세요   
// 1. '그룹/전화번호/이름'을 저장해야 한다
// 2. 그룹을 키값으로 넣으면 그 그룹에 해당하는 HashMap이 선택된다
// 3. 그룹의 HashMap에 전화번호를 키값으로 넣으면 이름이 나온다

// ### 메서드 ###
// 1. phoneBook에 새로운 그룹을 추가하는 메서드
// 2. phoneBook의 모든 목록을 한번에 출력해주는 메서드
// 3. 이미 존재하는 그룹에 전화번호를 추가하는 메서드 
   (그룹이 없으면 추가 못함)
// 4. 전화번호의 일부를 입력하면 입력한 부분과 일치하는 모든 사람의 목록을 출력하는 메서드
// 5. 이름을 입력하면 해당하는 사람의 전화번호를 모두 출력하는 메서드 (동명이인이 있는 경우 여러개 출력되야함)

// ※ 변경된 내용이 파일에 저장되어 프로그램을 다시 실행할때도 유지되도록 만들어보세요
 */

package quiz;

public class Quiz_240325_AM {
	
}
